Repository: MeshxFoundation/Meshx_ios
Catalog: MeshxIos/Language/*.lproj/Localizable.strings
Languages: es

# Keystore密码
source: Password
es: Contraseña

# Mesh地址
source: Mesh Addr
es: Dirección

# Mesh成功，广播中
source: Mesh Success，Pending...
es: Exitoso, difusión

# 一旦丢失将无法找回!
source: Cannot reback
es: ¡Una vez perdido, no podrás recuperarlo!

# 下一步
source: Next
es: Siguiente paso

# 两次密码不一致
source: Password not equal
es: las contraseñas no coinciden

# 二维码
source: QRCode
es: Código QR

# 二维码生成信息不能为空
source: Message is NULL
es: La información no puede estar vacía

# 交易备注
source: Memo
es: Observaciones

# 钱包密码
source: Pwd
es: Contraseña

# 钱包密码错误
source: Pwd Error
es: Contraseña incorrecta

# 交易市值 ￥0.0
source: Money ￥0.0
es: Dinero ¥ 0.0

# 交易记录
source: Records
es: Registro de transacciones

# 交易详情
source: Transaction Record
es: Detalles de la transacción

# 从相册选取
source: Library
es: Biblioteca

# 修改
source: Edit
es: Modificar

# 分享失败
source: Error
es: Falla

# 分享成功
source: Success
es: Éxito

# 分享给你
source: Share
es: Compartir

# 创建成功
source: Created
es: Creado con éxito

# 删除
source: Delete
es: Eliminar

# 删除提示！
source: Deleted!
es: Eliminar sugerencias!

# 助记词
source: Mnemonic
es: Mnemónico

# 助记词 %@ 有误
source: Error Mnemonic: %@
es: Mnemónico es incorrecto: %@

# 助记词个数有误
source: Need 12 Mnemonics
es: Necesita 12 teclas mnemotécnicas

# 助记词用于恢复钱包或重置钱包密码，将它准确地抄写到纸上，并存放在只有你知道的安全的地方。
source: Mnemonic is used to recover your wallet or reset password, write it on paper, and put it in safe place where you know it.
es: El mnemónico se utiliza para restaurar la billetera o restablecer la contraseña de la billetera, copiarla con exactitud en papel y guardarla en un lugar seguro que solo usted conoce.

# 助记词验证错误
source: Verify Phrase Error
es: Error de verificación

# 去开启
source: Open
es: Abierto

# 取消
source: Cancel
es: Cancelar

# 名称
source: Name
es: Nombre

# 啦啦啦啦啦啦啦
source: for test
es: para prueba

# 在此粘贴以太坊钱包Keystore文件内容。或通过生成keystore内容的二维码，扫描录入。
source: Cppy Keystore JSON, Or scan the QRcode。
es: Copie Keystore JSON, o escanee el QRcode.

# 在此输入助记词，用空格分隔
source: Enter phrase deliver by space.
es: ngrese la frase entregada en el espacio.

# 在此输入明文私钥
source: Enter privtekey
es: Ingrese la clave privada

# 填入Gas ,推荐范围100000
source: Gas ,(About)100000
es: Gas, rango recomendado 100000

# 填入Gas Price,推荐范围1~20
source: Gas Price,(About)1~20
es: Precio del gas, rango recomendado 1 ~ 20

# 填入钱包密码
source: Pwd
es: Contraseña

# 填入接收钱包地址（可扫描）
source: Enter Receiver's Address（Or Scan）
es: Complete la dirección de recepción (escaneable)

# 填入数量
source: value
es: Cantidad

# 备份/导出钱包
source: Backup/Export
es: Copia de seguridad / exportación

# 备份助记词
source: Backup
es: Mnemotécnico de rImportespaldo

# 复制Keystore
source: Copy Keystore
es: Copiar Keystore

# 复制地址
source: Copy Address
es: Copiar dirección

# 复制成功
source: Copied
es: Copia exitosa

# 复制明文私钥
source: Copy Private key
es: Copiar clave privada

# 安全警告：私钥未经加密，导出存在风险，建议使用Keystore进行备份。
source: Warning：Private key is not safe，Keystore backup recommend
es: Advertencia de seguridad: la clave privada no está encriptada. La exportación es arriesgada. Se recomienda usar Keystore para la copia de seguridad.

# 安全警告：数据未经加密，截屏导出存在风险，建议使用Keystore进行备份。
source: Warning：Screenshot is not safe，Keystore backup recommend
es: Advertencia de seguridad: los datos no están encriptados, y la captura de pantalla es arriesgada. Se recomienda utilizar Keystore para realizar copias de seguridad.

# 完成
source: Done
es: Completar

# 密码
source: PWD
es: Contraseña

# 密码太弱
source: Password must be 8 characters or longer.
es: La contraseña es muy débil

# 密码提示
source: Hint
es: Indicador de contraseña

# 密码提示（可不填）
source: Hint（Optional）
es: Sugerencia (Opcional)

# 导入钱包
source: Import
es: Importar

# 导出Keystore
source: Export Keystore
es: Exportar Keystore

# 导出明文私钥
source: Export Private Key
es: Exportar clave privada

# 将二维码放入框内，即可自动扫描
source: Focus on QRcode and scan automatically.
es: Céntrate en QRcode y escanea automáticamente.

# 将无法撤销操作
source: Cannot be undone
es: No podrá deshacer

# 已复制到剪贴板
source: Copied
es: Copiado

# 开启相机才能扫描二维码哦
source: need camera authorization
es: Necesita autorización de la cámara

# 强烈建议备份并妥善保管mxt秘钥和钱包钱包密码，否则一旦丢失将无法找回！
source: strongly recommended to back up，otherwise it will not be recovered once it is lost！
es: Muy recomendable para realizar copias de seguridad; de lo contrario, seguro se recuperará una vez que se haya perdido.

# 总计耗费
source: Total cost
es: Costo Total

# 总资产（RMB）
source: Assets（RMB）
es: Activos totales (RMB)

# 您还没有钱包哦！
source: You don't have a wallet yet.
es: ¡Aún no tienes una billetera!

# 抄写下你的钱包助记词
source: Write down your wallet mnemonic.
es: Copia tu billetera mnemónica

# 接收钱包地址
source: Receiver's Address
es: Recibiendo dirección

# 提示
source: Note
es: Nota

# 收款
source: Receive
es: Recibir

# 收款地址
source: Receive address
es: Dirección de la colección

# 新建钱包
source: Create
es: Crear

# 无法识别该二维码
source: Cannot recognize the qr code.
es: No reconocido el código QR

# 明文私钥
source: PrivateKey
es: Clave privada

# 来吧 创建或恢复您的快钱包
source: Come on create or restore your quickly wallet.
es: Vamos crear o restaurar tu billetera rápida

# 正在导入...
source: Importing...
es: Importando ...

# 残忍拒绝
source: Refuse
es: Rechazar

# 测试数据
source: Test
es: Prueba

# 添加新资产
source: Add new assets
es: Agregar nuevos activos

# 矿工奖励
source: Mining Fee
es: Recompensa del minero

# 确定
source: OK
es: DE ACUERDO

# 确认
source: OK
es: DE ACUERDO

# 确认你的钱包助记词
source: Make sure you remember mnemonic
es: Confirma tu billetera mnemónica

# 删除钱包
source: Delete
es: Eliminar

# 确认导入
source: Confirm to import
es: Confirmar importación

# 确认新建
source: Confirm to create
es: Confirmar nuevo

# 确认转账
source: Confirm to send
es: Confirmar nuevo

# 稍后再说
source: Later
es: Más tarde

# 简体中文
source: Simplified Chinese
es: Chino simplificado

# 编辑
source: edit
es: Editar

# 美元
source: USD
es: Dólar

# 设置钱包密码
source: Password
es: Contraseña

# 该信息不是钱包地址
source: It is not the wallet address.
es: Esta no es una dirección de billetera.

# 语言切换
source: Language
es: Idioma

# 请先新建钱包！
source: Create a new wallet first!
es: ¡Primero crea una nueva billetera!

# 请填入...
source: Please enter...
es: Por favor ingrese ...

# 请妥善保管钱包密码，
source: Please keep the password properly.
es: Por favor, mantenga segura la contraseña de su billetera

# 请按顺序点击助记词，以确认你的备份正确。
source: Click the mnemonic word in order to make sure your backup is correct.
es: Haga clic en el mnemónico para confirmar que su copia de seguridad es correcta.

# 请设置一个不小于8位的钱包密码
source: Enter password at least 8 characaters
es: Establezca una contraseña de no menos de 8 dígitos

# 请输入Gas
source: Gas
es: Por favor ingrese Gas

# 请输入Gas Price
source: Gas Price
es: Precio del gas

# 请输入钱包密码
source: Enter PWD
es: Ingresa la contraseña

# 请输入数量
source: Enter Value
es: Cantidad de entrada

# 请输入钱包名称
source: Enter Name
es: Ingresa un nombre

# 请输入钱包地址
source: Enter Address
es: Dirección de entrada

# 请选择备份/导出钱包方式
source: Select backup/export wallet
es: Elija la cartera de copia de seguridad / exportación wallet

# 请选择系统语言
source: Select language
es: Seleccionar idioma

# 请选择货币单位
source: Select unit
es: Seleccionar unidad

# 账户不存在
source: The account does not exist
es: La cuenta no existe

# 货币单位
source: Unit
es: Unidad

# 转账
source: Send
es: Enviar

# 交易成功
source: Success
es: Éxito

# 交易失败
source: Failed
es: Falla

# 转账数量
source: Amount
es: Cantidad

# 输入不小于8位的钱包密码
source: Enter password
es: Ingresa la contraseña

# 输入钱包密码
source: Enter Password
es: Ingresa la contraseña

# 输入密码提示（可不填）
source: Enter Hint（Optional）
es: Ingrese la sugerencia (Opcional)

# 输入钱包名称
source: Enter name
es: Ingresa un nombre

# 重复
source: Repeat
es: Repetir

# 默认
source: Default
es: Defecto

# 重复钱包密码
source: Repeat
es: Repetir

# 重复钱包钱包密码
source: Repeat
es: Repetir

# 重要提示：1.请离线保存；2.请勿使用网络传输；3.二维码禁止保存、截图和拍照，确保在四周无人和摄像头环境下扫码。
source: Important note: 1. Please keep it offline; 2. Do not use network transmission; 3. The qr code is forbidden to save, screenshots and photos to ensure that no one is scanning the code in the surrounding area.
es: Importante: 1. Guarde sin conexión; 2. No use transmisión de red; 3. El código QR prohíbe guardar, captura de pantalla y tomar fotografías, para garantizar el código de escaneo en el entorno y entorno de la cámara.

# 重要操作验证
source: Password verification
es: Verificación de contraseña

# 钱包二维码
source: Wallet QRCode
es: Código QR de Wallet

# 钱包切换
source: Switch wallet
es: Cambio de billetera

# 钱包删除后，将无法撤销操作，请确保已备份钱包私钥！
source: After wallet is deleted,Cannot be undone,Please make sure wallet has been backed up.
es: Una vez que se borre la billetera, no podrá deshacerla. ¡Asegúrese de haber respaldado la clave privada de su billetera!

# 钱包名称
source: Name
es: Nombre

# 钱包地址
source: Address
es: Dirección

# 暂无交易记录
source: No transactions found
es: Sin historial de transacciones

# Gas Limit太低
source: Gas Limit too low
es: El límite de gas es demasiado bajo

# Gas Limit太低,已改为最低预估:
source: Gas Limit too low, need about：
es: Límite de gas demasiado bajo, necesita sobre:

# 创建或导入您的钱包
source: Create/Import your wallet
es: Crea o importa tu billetera

# 总资产
source: Total Assets
es: Total de activos

# 扫描
source: Scan
es: Escaneo

# 转账
source: Send
es: Transferir

# 收款
source: Recv.
es: Recibo.

# 慢
source: Slow
es: Lento

# 快
source: Fast
es: Rápido

# 创建中...
source: Creating...
es: Creando...

# 收款金额
source: Amount
es: Monto

# 收款数量
source: payAccount
es: Cantidad

# 复制
source: Copy
es: Copia

# 发现剪贴板地址
source: Found Clipboard Address
es: Dirección del portapapeles encontrado

# 发现已注册地址
source: Found Registered Address
es: Dirección registrada encontrada

# 扫描二维码
source: Scanning for QR code...
es: Escanear código QR...

# 相机不可用
source: Camera disabled
es: La cámara no está disponible

# 搜索中...
source: Searching...
es: Buscando...

# 识别中...
source: Analysing Photo...
es: Identificación...

# 未找到以太坊域名
source: ENS name not registered.
es: Dominio Ethereum no encontrado

# 未找到二维码
source: No QR code found.
es: No se encontró código QR

# 输入以太坊域名
source: Enter an ENS name
es: Ingrese el nombre de dominio Ethereum

# 请在设置中启用相机
source: Please enable the camera in your settings to scan QR codes.
es: Por favor active la cámara en la configuración

# 请在设置中启用相册
source: Please enable photos in your settings to scan QR codes from your camera roll.
es: Por favor habilite álbumes en la configuración

# 搜索以太坊域名
source: Lookup ENS name
es: Buscar Ethereum Nombre de Dominio

# 查询交易
source: Transaction
es: Transacción de consulta

# 管理
source: Manager
es: Gestión

# 交易类型
source: Type
es: Tipo

# 付款钱包
source: From
es: De

# 收款钱包
source: To
es: A

# 交易时间
source: Time
es: Hora

# 网络
source: Network
es: Red

# 区块高度
source: Block #
es: Altura del bloque

# 交易号
source: Transaction #
es: Número de transacción

# 密码验证中...
source: Verify password...
es: Verificación de contraseña...

# 自定义Gas Limit,ETH转账为21000,代币或合约按需填写
source: Custom Gas
es: Gas personalizado

# 自定义Gas Price,一般为(20~100)Gwei
source: Custom Gas Price
es: Precio de Gas Personalizado

# 广播中
source: Pending
es: Pendiente

# 费用核算中...
source: estimate gas...
es: Contabilidad de costes...

# 汇率转换
source: Select currency
es: Conversión de tasa

# 添加资产
source: Add assets
es: Agregar activos

# 扫描二维码支付
source: Scan QRCode to pay
es: Escanear el pago del código QR

# 设置收款金额
source: Set the payAccount
es: Establecer el monto del pago

# 复制支付地址
source: copy payAddress
es: Copie la dirección de pago

# *密码用于保护私钥和交易授权
source: *Password is used to protect private keys and transaction authorization
es: * La contraseña se usa para proteger claves privadas y autorizaciones de transacciones

# *Meshx将不会存储密码,请务必谨记
source: *Meshx will not store passwords, please be sure to remember
es: * Meshx no almacenará contraseñas, por favor asegúrese de recordar
